012/RailsAndCappuccino/app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2009-11-16 23:48:32', 'ahah', 'shala', '2009-11-16 23:48:32')
---
  def create
    # logger.error("-- try to create : #{params.inspect}--")
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save