009/app/controllers/posts_controller.rb

INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`) VALUES('2009-05-16 11:28:26', 'Welcome to Cappuccino', 'Lorm ipsum dolor sit amet Etc ...', '2009-05-16 11:28:26')
---
  def create
    # logger.error("-- try to create : #{params.inspect}--")
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 9)
UPDATE `posts` SET `updated_at` = '2009-05-16 10:00:38', `title` = 'acme', `body` = 'toon' WHERE `id` = 9
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])